CoreTemplates/legacy/Core Template AMI - kEpsilon/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../Parameters/controlDict.cpp"

application     pimpleFoam;

startFrom       $startFrom;

//startTime       $startTime;

stopAt          endTime;

endTime         $endTime;

deltaT          $deltaT;

maxDeltaT       $maxDeltaT;

writeControl    timeStep;
writeInterval   $writeInterval;

////- For testing with moveDynamicMesh
//deltaT          0.01;
//writeControl    timeStep;
//writeInterval   1;

purgeWrite     $purgeWrite;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  $adjustTimeStep;

maxCo           $maxCo;

functions
{

    startupDeltaTCap
    {
        type        fluidMaxDeltaT;

        maxCo       5;

        maxDeltaT table
        (
            (0         1.2e-8)
            (2.4e-7    1.2e-8)
            (1.2e-6    5.0e-5)
        );
    }


    forcesBlades
    {
        type            forces;
        libs            ("libforces.so");

        patches         (propeller);    

        // For incompressible simpleFoam:
        rho             rhoInf;
        rhoInf          1.225;      

        CofR            (0 0 0);   
        log             yes;
    }

    velocityProbe
    {
        type            probes;
        libs            ("libsampling.so");
        fields          (U);
        probeLocations  ((0.128 0.01 0.01));  
         writeControl    writeTime;
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        patches         (propeller);
        log             yes;
        writeControl    writeTime;

        // Enable to also view y+ distribution in paraFoam
        // objects         ();
    }

    wallShear
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (propeller);
        log             yes;
        writeControl    writeTime;

    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        writeControl    writeTime;
        fields
        (
            p
            U
            k
            epsilon
        );
    }

    vorticity
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    Q
    {
        type            Q;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    CourantNumber
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");

        executeControl      timeStep;
        executeInterval     1;

        writeControl        writeTime;
    }

    Umax
    {
        type                volFieldValue;
        libs                ("libfieldFunctionObjects.so");

        writeControl        writeTime;

        log                 true;
        writeFields         false;
        writeLocation       true;

        cellZone            all;
        operation           maxMag;

        fields
        (
            U
        );
    }

    scalarMax
    {
        type                volFieldValue;
        libs                ("libfieldFunctionObjects.so");

        writeControl        writeTime;

        log                 true;
        writeFields         false;
        writeLocation       true;

        cellZone            all;
        operation           max;

        fields
        (
            p
            k
            epsilon
            Co
        );
    }

    scalarMin
    {
        type                volFieldValue;
        libs                ("libfieldFunctionObjects.so");

        writeControl        writeTime;

        log                 true;
        writeFields         false;
        writeLocation       true;

        cellZone            all;
        operation           min;

        fields
        (
            p
            k
            epsilon
        );
    }

    writePatchFields
    {
        type            surfaces;
        enabled         $impermeableEnabled;
        libs            ("libsampling.so");
 
        writeControl    timeStep;
        writeInterval   1;
        surfaceFormat   vtk;
 
        fields          (p U);
 
        interpolationScheme cellPoint;  //<- default
 
        surfaces
        {
            propeller
            {
                type            patch;
                patches         (propeller);
                interpolate     false;
            }
        }
    }

    writePermeableSurfaceFields
    {
        type            surfaces;
        enabled         $permeableEnabled;
        libs            ("libsampling.so");
       
        writeControl    timeStep;
        writeInterval   1;
        surfaceFormat   vtk;
 
        fields          (p U);
 
        interpolationScheme cellPoint;
 
        surfaces
        {
            permeableSurface
            {
                type            triSurfaceMesh;
                surface         permeableSurface.stl;
                source          cells;
                interpolate     false;
            }
        }
    }
}
// ************************************************************************* //
